Perf_Testing/logging-users.yml
config:
  target: "http://46.101.243.4:5005" # Base URL
  phases:
    - duration: 60   # Test duration in seconds
      arrivalRate: 100 # Requests per second
  payload:
    - path: users.csv # Path to your CSV file
      fields:
        - username
        - password
scenarios:
  - name: User login and actions
    flow:
      - post: # Login request
          url: "/login"
          json:
            username: "{{ username }}" # Replace with username from CSV
            password: "{{ password }}" # Replace with password from CSV
      - get: # Access home page
          url: "/"
      - get: # Check weather
          url: "/weather"
          qs:
            city: "New York"
      - post: # Upload a file
          url: "/upload"
          headers:
            Content-Type: "multipart/form-data"
          formData:
            file: "@/path/to/testfile.pdf"
      - get: # Logout
          url: "/logout"