Perf_Testing/weather.yml
### Weather Check Test: weather.yml
config:
  target: "http://46.101.243.4:5005" # Base URL
  phases:
    - duration: 60   # Duration of the test in seconds
      arrivalRate: 100 # Requests per second

scenarios:
  - name: User checks weather
    flow:
      - get:
          url: "/weather"
          qs:
            city: "New York"
          headers:
            Cookie: "{{ session_cookie }}"